app/controllers/songs_controller.rb

  def index
    #binding.pry
    if params[:artist_id]
      begin
      @songs = Artist.find(params[:artist_id]).songs
      rescue ActiveRecord::RecordNotFound
      redirect_to artists_path, alert: "Artist not found."
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show

    #binding.pry
    if Song.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]